# ![Ironhack logo](https://i.imgur.com/1QgrNNw.png)

# Lab | SQL Select

## Introduction

In this lab you will practice how to use the `SELECT` statement which will be extremely useful in your future work as a data analyst/scientist/engineer. **You will use the `publications` database.** 

You will create a `solutions.ipynb` file in the `your-code` directory to record your solutions to all challenges.

In [2]:
import os
os.environ["GOOGLE_APPLICATION_CREDENTIALS"]="/Users/MarLizana/Desktop/IH/ironhack_service_account_big_query.json"
from google.cloud import bigquery

In [3]:
client = bigquery.Client()

# Challenge 1 - Who Have Published What At Where?

In this challenge you will write a `SELECT` query that joins various tables to figure out what titles each author has published at which publishers. Your output should have at least the following columns:

* `AUTHOR_ID` - the ID of the author
* `LAST_NAME` - author last name
* `FIRST_NAME` - author first name
* `TITLE` - name of the published title
* `PUBLISHER` - name of the publisher where the title was published

Your output will look something like below:

![Challenge 1 output](challenge-1.png)

*Note: the screenshot above is not the complete output.*

If your query is correct, the total rows in your output should be the same as the total number of records in Table `titleauthor`.

In [4]:
queryC1 = """
SELECT 
    a.au_id AS Author_id,
    a.au_lname AS Last_Name,
    a.au_fname AS First_Name,
    t.title AS Title,
    p.pub_name AS Publisher
FROM 
    `ironhack-data-analytics-265219.publications.titleauthor` AS ta
INNER JOIN
    `ironhack-data-analytics-265219.publications.authors` AS a
ON 
    ta.au_id = a.au_id
INNER JOIN
    `ironhack-data-analytics-265219.publications.titles` AS t
ON 
    ta.title_id = t.title_id
INNER JOIN
    `ironhack-data-analytics-265219.publications.publishers` AS p
ON
    t.pub_id = p.pub_id
"""

query_job = client.query(query=queryC1)

In [5]:
query_job.to_dataframe()

,Author_id,Last_Name,First_Name,Title,Publisher
0,899-46-2035,Ringer,Anne,Is Anger the Enemy?,New Moon Books
1,846-92-7186,Hunter,Sheryl,Secrets of Silicon Valley,Algodata Infosystems
2,213-46-8915,Green,Marjorie,The Busy Executive's Database Guide,Algodata Infosystems
3,267-41-2394,O'Leary,Michael,Cooking with Computers: Surreptitious Balance ...,Algodata Infosystems
4,267-41-2394,O'Leary,Michael,"Sushi, Anyone?",Binnet & Hardley
5,899-46-2035,Ringer,Anne,The Gourmet Microwave,Binnet & Hardley
6,724-80-9391,MacFeather,Stearns,Computer Phobic AND Non-Phobic Individuals: Be...,Binnet & Hardley
7,756-30-7391,Karsen,Livia,Computer Phobic AND Non-Phobic Individuals: Be...,Binnet & Hardley
8,722-51-5454,DeFrance,Michel,The Gourmet Microwave,Binnet & Hardley
9,724-80-9391,MacFeather,Stearns,Cooking with Computers: Surreptitious Balance ...,Algodata Infosystems
10,409-56-7008,Bennet,Abraham,The Busy Executive's Database Guide,Algodata Infosystems
11,427-17-2319,Dull,Ann,Secrets of Silicon Valley,Algodata Infosystems
12,998-72-3567,Ringer,Albert,Is Anger the Enemy?,New Moon Books
13,672-71-3249,Yokomoto,Akiko,"Sushi, Anyone?",Binnet & Hardley
14,486-29-1786,Locksley,Charlene,Emotional Security: A New Algorithm,New Moon Books
15,648-92-1872,Blotchet-Halls,Reginald,Fifty Years in Buckingham Palace Kitchens,Binnet & Hardley
16,998-72-3567,Ringer,Albert,Life Without Fear,New Moon Books
17,238-95-7766,Carson,Cheryl,But Is It User Friendly?,Algodata Infosystems
18,486-29-1786,Locksley,Charlene,Net Etiquette,Algodata Infosystems
19,807-91-6654,Panteley,Sylvia,"Onions, Leeks, and Garlic: Cooking Secrets of ...",Binnet & Hardley
20,712-45-1867,del Castillo,Innes,Silicon Valley Gastronomic Treats,Binnet & Hardley
21,172-32-1176,White,Johnson,Prolonged Data Deprivation: Four Case Studies,New Moon Books
22,213-46-8915,Green,Marjorie,You Can Combat Computer Stress!,New Moon Books
23,274-80-9391,Straight,Dean,Straight Talk About Computers,Algodata Infosystems
24,472-27-2349,Gringlesby,Burt,"Sushi, Anyone?",Binnet & Hardley

# Challenge 2 - Who Have Published How Many At Where?

Elevating from your solution in Challenge 1, query how many titles each author has published at each publisher. Your output should look something like below:

![Challenge 2 output](challenge-2.png)

*Note: the screenshot above is not the complete output.*

To check if your output is correct, sum up the `TITLE COUNT` column. The sum number should be the same as the total number of records in Table `titleauthor`.

*Hint: In order to count the number of titles published by an author, you need to use [ COUNT](https://cloud.google.com/bigquery/docs/reference/standard-sql/aggregate_functions#count). Also check out [Group By](https://cloud.google.com/bigquery/docs/reference/standard-sql/query-syntax#group-by-clause) because you will count the rows of different groups of data. Refer to the references and learn by yourself. These features will be formally discussed in the Temp Tables and Subqueries lesson.*

In [6]:
queryC2 = """
SELECT 
    a.au_id AS Author_id,
    a.au_lname AS Last_Name,
    a.au_fname AS First_Name,
    p.pub_name AS Publisher,
    COUNT(t.title) AS Title
FROM 
    `ironhack-data-analytics-265219.publications.titleauthor` AS ta
INNER JOIN
    `ironhack-data-analytics-265219.publications.authors` AS a
ON 
    ta.au_id = a.au_id
INNER JOIN
    `ironhack-data-analytics-265219.publications.titles` AS t
ON 
    ta.title_id = t.title_id
INNER JOIN
    `ironhack-data-analytics-265219.publications.publishers` AS p
ON
    t.pub_id = p.pub_id
GROUP BY
    1,2,3,4
ORDER BY
    5 DESC
"""

query_job = client.query(query=queryC2)

In [7]:
query_job.to_dataframe()

      Author_id       Last_Name First_Name             Publisher  Title
0   998-72-3567          Ringer     Albert        New Moon Books      2
1   899-46-2035          Ringer       Anne        New Moon Books      1
2   846-92-7186          Hunter     Sheryl  Algodata Infosystems      1
3   213-46-8915           Green   Marjorie  Algodata Infosystems      1
4   267-41-2394         O'Leary    Michael  Algodata Infosystems      1
5   267-41-2394         O'Leary    Michael      Binnet & Hardley      1
6   899-46-2035          Ringer       Anne      Binnet & Hardley      1
7   724-80-9391      MacFeather    Stearns      Binnet & Hardley      1
8   756-30-7391          Karsen      Livia      Binnet & Hardley      1
9   722-51-5454        DeFrance     Michel      Binnet & Hardley      1
10  724-80-9391      MacFeather    Stearns  Algodata Infosystems      1
11  409-56-7008          Bennet    Abraham  Algodata Infosystems      1
12  427-17-2319            Dull        Ann  Algodata Infosystems      1
13  672-71-3249        Yokomoto      Akiko      Binnet & Hardley      1
14  486-29-1786        Locksley   Charlene        New Moon Books      1
15  648-92-1872  Blotchet-Halls   Reginald      Binnet & Hardley      1
16  238-95-7766          Carson     Cheryl  Algodata Infosystems      1
17  486-29-1786        Locksley   Charlene  Algodata Infosystems      1
18  807-91-6654        Panteley     Sylvia      Binnet & Hardley      1
19  712-45-1867    del Castillo      Innes      Binnet & Hardley      1
20  172-32-1176           White    Johnson        New Moon Books      1
21  213-46-8915           Green   Marjorie        New Moon Books      1
22  274-80-9391        Straight       Dean  Algodata Infosystems      1
23  472-27-2349      Gringlesby       Burt      Binnet & Hardley      1

# Challenge 3 - Best Selling Authors

Who are the top 3 authors who have sold the highest number of titles? Write a query to find out.

Requirements:

* Your output should have the following columns:
	* `AUTHOR_ID` - the ID of the author
	* `LAST_NAME` - author last name
	* `FIRST_NAME` - author first name
	* `TOTAL` - total number of titles sold from this author
* Your output should be ordered based on `TOTAL` from high to low.
* Only output the top 3 best selling authors.

*Hint: In order to calculate the total of profits of an author, you need to use the [SUM function](https://cloud.google.com/bigquery/docs/reference/standard-sql/aggregate_functions#sum). Refer to the reference and learn how to use it.*

In [8]:
queryC3 = """
SELECT 
    a.au_id AS Author_id,
    a.au_lname AS Last_Name,
    a.au_fname AS First_Name,
    SUM(s.qty) AS Qty_books
    
FROM 
    `ironhack-data-analytics-265219.publications.titleauthor` AS ta
INNER JOIN
    `ironhack-data-analytics-265219.publications.authors` AS a
ON 
    ta.au_id = a.au_id     
INNER JOIN
    `ironhack-data-analytics-265219.publications.sales` AS s
ON 
    s.title_id = ta.title_id

GROUP BY
    1,2,3
ORDER BY
    4 DESC
LIMIT 
    3
"""

query_job = client.query(query=queryC3)

In [9]:
query_job.to_dataframe()

     Author_id Last_Name First_Name Qty_books
0  899-46-2035    Ringer       Anne       148
1  998-72-3567    Ringer     Albert       133
2  213-46-8915     Green   Marjorie        50

# Challenge 4 - Best Selling Authors Ranking

Now modify your solution in Challenge 3 so that the output will display all 23 authors instead of the top 3. Note that the authors who have sold 0 titles should also appear in your output (ideally display `0` instead of `NULL` as the `TOTAL`). Also order your results based on `TOTAL` from high to low.

In [10]:
queryC4 = """
SELECT 
    a.au_id AS Author_id,
    a.au_lname AS Last_Name,
    a.au_fname AS First_Name,
    SUM(s.qty) AS Qty_books
    
FROM 
    `ironhack-data-analytics-265219.publications.titleauthor` AS ta
FULL JOIN
    `ironhack-data-analytics-265219.publications.authors` AS a
ON 
    ta.au_id = a.au_id     
FULL JOIN
    `ironhack-data-analytics-265219.publications.sales` AS s
ON 
    s.title_id = ta.title_id
GROUP BY
    1,2,3
ORDER BY
    4 

"""

query_job = client.query(query=queryC4)

In [11]:
query_job.to_dataframe()

      Author_id       Last_Name   First_Name Qty_books
0   893-72-1158        McBadden      Heather      None
1   527-72-3246          Greene  Morningstar      None
2   724-08-9931        Stringer         Dirk      None
3   341-22-1782           Smith      Meander      None
4   712-45-1867    del Castillo        Innes        10
5   409-56-7008          Bennet      Abraham        15
6   172-32-1176           White      Johnson        15
7   274-80-9391        Straight         Dean        15
8   648-92-1872  Blotchet-Halls     Reginald        20
9   756-30-7391          Karsen        Livia        20
10  672-71-3249        Yokomoto        Akiko        20
11  472-27-2349      Gringlesby         Burt        20
12  486-29-1786        Locksley     Charlene        25
13  238-95-7766          Carson       Cheryl        30
14  807-91-6654        Panteley       Sylvia        40
15  722-51-5454        DeFrance       Michel        40
16  724-80-9391      MacFeather      Stearns        45
17  267-41-2394         O'Leary      Michael        45
18  213-46-8915           Green     Marjorie        50
19  427-17-2319            Dull          Ann        50
20  846-92-7186          Hunter       Sheryl        50
21  998-72-3567          Ringer       Albert       133
22  899-46-2035          Ringer         Anne       148

# Bonus Challenge - Most Profiting Authors

Authors earn money from their book sales in two ways: advance and royalties. An advance is the money that the publisher pays the author before the book comes out. The royalties the author will receive is typically a percentage of the entire book sales. The total profit an author receives by publishing a book is the sum of the advance and the royalties.

Given the information above, who are the 3 most profiting authors and how much royalties each of them have received? Write a query to find out.

Requirements:

* Your output should have the following columns:
	* `AUTHOR_ID` - the ID of the author
	* `LAST_NAME` - author last name
	* `FIRST_NAME` - author first name
	* `PROFIT` - total profit the author has received combining the advance and royalties
* Your output should be ordered from higher `PROFIT` values to lower values.
* Only output the top 3 most profiting authors.

*Hints:* 

* If a title has multiple authors, how they split the royalties can be found in the `royaltyper` column of the `titleauthor` table.
* We assume the coauthors will split the advance in the same way as the royalties.

In [12]:
query_c1_s3 = """
SELECT
    author_id,
    SUM(sales_royalty + t.advance*ta.royaltyper/100) AS profits
    
FROM(
    SELECT 
        t.title_id AS title_id,
        a.au_id AS author_id,
        SUM(t.price * s.qty * t.royalty / 100 * ta.royaltyper / 100) AS sales_royalty

    FROM 
        `ironhack-data-analytics-265219.publications.sales` AS s
    INNER JOIN
        `ironhack-data-analytics-265219.publications.titles` AS t
    ON 
        s.title_id = t.title_id
    INNER JOIN
        `ironhack-data-analytics-265219.publications.titleauthor` AS ta
    ON
        ta.title_id = s.title_id
    INNER JOIN
        `ironhack-data-analytics-265219.publications.authors` AS a
    ON
        a.au_id = ta.au_id
    GROUP BY
        1,2) summary

INNER JOIN
    `ironhack-data-analytics-265219.publications.sales` AS s
ON
    s.title_id = summary.title_id
    
INNER JOIN
    `ironhack-data-analytics-265219.publications.titles` AS t
ON 
    s.title_id = t.title_id
    
INNER JOIN
    `ironhack-data-analytics-265219.publications.titleauthor` AS ta
ON
    ta.title_id = s.title_id
GROUP BY
    1
ORDER BY
    2 DESC
    

"""
query_job = client.query(query=query_c1_s3)
query_job.to_dataframe()

      author_id    profits
0   899-46-2035  39696.352
1   722-51-5454  30086.112
2   213-46-8915  20198.092
3   998-72-3567  15685.148
4   267-41-2394  13050.882
5   724-80-9391  12057.440
6   409-56-7008  10071.964
7   846-92-7186   8100.000
8   427-17-2319   8100.000
9   672-71-3249   8035.976
10  472-27-2349   8026.982
11  238-95-7766   7110.160
12  807-91-6654   7083.800
13  756-30-7391   7064.770
14  274-80-9391   5029.985
15  648-92-1872   4033.460
16  486-29-1786   4019.975
17  172-32-1176   2029.985
18  712-45-1867     23.988